УТ/src/InformationRegisters/АУ_СоответствиеВидовНоменклатурыМаркировки/АУ_СоответствиеВидовНоменклатурыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АУ_СоответствиеВидовНоменклатурыМаркировки</name>
  <resources>
    <name>ПарныйВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/АУ_СоответствиеВидовНоменклатурыМаркировки/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("АУ_ПропускОбратнойЗаписи") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл

		Если Не ЗначениеЗаполнено(ЗаписьНабора.ВидНоменклатуры)
			Или Не ЗначениеЗаполнено(ЗаписьНабора.ПарныйВидНоменклатуры) Тогда
			Продолжить;
		КонецЕсли;

		Если ЗаписьНабора.ВидНоменклатуры = ЗаписьНабора.ПарныйВидНоменклатуры Тогда
			Продолжить;
		КонецЕсли;

		НаборОбратный = РегистрыСведений.АУ_СоответствиеВидовНоменклатурыМаркировки.СоздатьНаборЗаписей();
		НаборОбратный.Отбор.ВидНоменклатуры.Установить(ЗаписьНабора.ПарныйВидНоменклатуры);
		НаборОбратный.ДополнительныеСвойства.Вставить("АУ_ПропускОбратнойЗаписи", Истина);

		СтрокаОбратная = НаборОбратный.Добавить();
		СтрокаОбратная.ВидНоменклатуры = ЗаписьНабора.ПарныйВидНоменклатуры;
		СтрокаОбратная.ПарныйВидНоменклатуры = ЗаписьНабора.ВидНоменклатуры;

		НаборОбратный.Записать();

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
